Public Attributes | List of all members
API_UserInfo Struct Reference
Project Operations
Information on a registered Team Member. More...
#include <APIdefs_Environment.h>
 Public Attributes
 GS::uchar_t  | loginName [API_UniLongNameLen]
Unique member login name as Unicode string.
 GS::uchar_t  | fullName [API_UniLongNameLen]
member full name as Unicode string
 API_Guid  | guid
member identifier
 short  | userId
member ID
 bool  | connected
actually connected to the teamwork project or not
Detailed Description
Information on a registered Team Member.
Remarks
Refer to the ACAPI_Teamwork_ProjectSharing function for more details.